---
kind: property
id: P:Autodesk.Revit.DB.TableSectionData.HideSection
source: html/f10cba89-4a11-3db5-6d20-f6fb8868c6e3.htm
---
# Autodesk.Revit.DB.TableSectionData.HideSection Property

Whether or not the section is hidden.

## Syntax (C#)
```csharp
public bool HideSection { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: This operation is forbidden for cells in standard schedule body sections.